[
    {
        "content": "Mr. Bista was the consultant in the Mid Term Evaluation Assignment for the Right Here Right Now (RHRN) – A Strategic Partnership of the Dutch Minister of Foreign Affairs. He has successfully collected the data for the assignment, through desk review, Interviews and Focus group discussions. Mr. Bista also performed the data analysis combining the data from the above data collection methods with data from surveys and outcome Harvesting. The quality of the report written by Mr. Bista met the standard set in term of completeness, depth, and timeliness.",
        "name": "Aryanti Radyowijati, Director",
        "organization": "Results in Health, Leiderdorps",
        "location": "The Netherlands"
    },
    {
        "content": "Mr. Bibhuti Bista was affiliated with the department of Sociology in Abo Akademi University as a Researcher. He provided lectures on Sociology of Developing Countries, with special emphasis on Nepal, for Master’s and Baclelor’s degree students of Abo Akademi University. Mr. Bista has clearly strengthened the competence of our sociological department and he has been a most valuable friend and colleague, with excellent social skills. He has greatly improved our understanding of the social conditions in Nepal at the same time as he himself has been open to new impressions about Finnish society.",
        "name": "Susan Sundback, Professor of Sociology",
        "organization": "Åbo Akademi University, Social Science Department",
        "location": "Turku, Finland"
    },
    {
        "content": "All these years of his contribution I can vouch for his excellent quality among which are solid work ethics, capacity to come up with solutions, excellent problem solving ability, honest and pleasant character. From his work and proximity, I can deduce that Mr. Bista is at all time very cooperative, friendly, and hardworking individual.",
        "name": "Mohan Raj Sharma, Executive Director",
        "organization": "Nepal Biogas Promotion Association",
        "location": "Lalitpur, Nepal"
    },
    {
        "content": "Bibhuti Bista worked with SFCG in the position of Country Evaluator for Nepal Partnership for Children and Youth in Peacebuilding Project. We found Bibhuti technically sound in this position. He has a string coordination and communication skills and is very solution oriented. He is a good team player and his contribution has been integral in meeting the project’s objectives in an effective manner. He is an excellent planner and ensured that all project activities were carried out as per the set timeline while   also efficiently handling any last minute priorities.",
        "name": "Rajendra Mulmi, Country Director",
        "organization": "Search for Common Ground",
        "location": "Kathmandu, Nepal"
    },
    {
        "content": "Bibhuti Bista worked with Tdh Nepal as a Research Coordinator for the research project on Commercial Sexual Exploitation of Children (CSEC). During his tenure Mr. Bista played a lead role to support the research team including expatriate researchers. He was leading in planning of the research activities, mentoring the team, developing and testing the questionnaire, in-depth case studies and writing a comprehensive report.",
        "name": "Sebastian Zug, Ph.D, Country Representative",
        "organization": "TdH, Nepal",
        "location": "Kathmandu, Nepal"
    },
    {
        "content": "Mr. Bista was hired by YHDO as the Lead Consultant – International for the final evaluation and endline survey of Counter Trafficking in Persons – (CTIP) II project. Mr. Bista developed the entire plan for both assignments in an effective way. His planning, analysis, and writing skills were outstanding and highly credible. We found Bibhuti technically sound. We highly acknowledge his time and team management skills, honest engagement, high level of responsibility, reliability and self-organization capacity.  ",
        "name": "Dr. Abdul Rasheed, MD, MPH, Executive Director",
        "organization": "Youth Health Development Organization",
        "location": "Kabul, Afghanistan"
    },
    {
        "content": "In reference to the organisational assessment and program evaluation of PHASE Nepal, Mr. Bista served as lead researcher and did an outstanding job and was responsible for putting together the evaluation framework, conducting the data collection and interviews. Throughout the whole process, Mr. Bista was an independent worker and I did not have to do a lot of directing or guiding in terms of the details of the assessment. He showed himself to be very competent, hardworking, and conscientious in all aspects of the assessment. It was a pleasure to work with him.",
        "name": "Stephen J. Knoble, MHS, PA-C",
        "organization": "Training Consultant, Nick Simons Institute",
        "location": "Lalitpur, Nepal"
    },
    {
        "content": "Bibhuti showed a high level of responsibility, reliability and self-organization capacity. During the time of cooperation, Bibhuti became a major support for NBPA and the GIZ cooperation in particular. Any employer can be more than happy to engage such a friendly, diligent and hard working person.",
        "name": "Paul Marek, Technical Advisor",
        "organization": "GIZ/NBPA",
        "location": "Kathmandu, Nepal"
    },
    {
        "content": "Mr. Bista was recruited to lead the mid-term evaluation of the HDI in Humla. He is serious in his work and come across as having an honest engagement in understanding the project and the people participating. Mr. Bista is very social and he was good at creating trust between the evaluators and the beneficiaries during interviews. The report has been valuable for DF after the evaluation and has enabled DF and partners to discuss the recommendations and what needed to be improved and changed.",
        "name": "Aina Grodahl, Programme Coordinator for Nepal",
        "organization": "The Development Fund (DF)",
        "location": "Norway"
    },
    {
        "content": "In his role as team lead for the mid-line evaluation of the Disability Prevention and Rehabilitation Program (DPRP), Mr. Bista showcased remarkable expertise and dedication. He consistently exhibited a high level of commitment, professionalism, and proficiency. His proactive approach to enhancing systems, processes, and tools contributed significantly to the effectiveness of data collection and analysis. Mr. Bista demonstrated exceptional leadership skills, fostering collaboration and mentorship to ensure the successful execution of the evaluation.",
        "name": "Deepak Raj Sapkota, Executive Director",
        "organization": "Karuna Foundation Nepal",
        "location": "Phnom Penh, Cambodia"
    },
    {
        "content": "The evaluation of Rural Youth Development Project (RYDP) was conducted in an extra ordinary professional way. Preparation was well structured (inception report), coordination within the team as well as with all concerned stakeholders was very effective and draft such as final report were submitted in a very best time. The evaluation report is very well structured and formatted and reflects in a very transparent way about used methods, achieved results and outlines relevant recommendations. <br> For your proactive work I am thanking you on behalf of our AWO Nepal team!",
        "name": "Felix Neuhaus, Director ",
        "organization": "AWO International e.V. Regional Office South Asia",
        "location": "Lalitpur, Nepal/Phnom Penh, Cambodia"
    },
    {
        "content": "Mr. Bibhuti Bista successfully led and completed the final evaluation of “Promoting Child Friendly Learning for Quality Education”. During his involvement with CRF he performed and completed the services on time with high quality report. He is good in time management and his leadership skills were exceptional.",
        "name": "Vorn Koy, Executive Director",
        "organization": "Child Rights Foundation (CRF)",
        "location": "Phnom Penh, Cambodia"
    },
    {
        "content": "Mr. Bibhuti Bista completed the final evaluation of Child Friendly Model Village (CFMV) project. We found Mr. Bista as a hardworking professional with determination and competent enough in leading and completing the evaluation task as a team leader. He possesses adequate theoretical and methodological knowledge and skills for evaluation. He has comprehensive anthropological and phenomenological understanding-highly demanding proficiency for interacting with the project stakeholders especially in the new communities.",
        "name": "Dikendra L. Dhakal, Programme Director",
        "organization": "Back to Life e.V.",
        "location": "Kathmandu, Nepal"
    },
    {
        "content": "Mr. Bibhuti Bista has successfully completed Mid-term evaluation of an EU-Funded PARIWARTAN Project. He has rendered his services with the highest degree of responsibility, respected the timeline, welcomed the feedback and submitted his delivery with a great professionalism",
        "name": "Samjhana Bista, Head of Programme",
        "organization": "DCA, Country Office",
        "location": "Kathmandu, Nepal"
    }
]
